docs/auditoria-produccion/evidencia/H4-k6-login.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/login.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * login: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
login   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
login   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
login   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
login   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
login   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
login   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
login   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
login   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
login   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
login   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
login   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
login   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
login   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
login   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
login   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
login   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
login   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
login   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
login   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
login   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
login   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
login   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
login   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
login   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
login   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
login   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
login   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
login   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
login   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
login   [ 100% ] 10 VUs  30.0s/30s

running (0m31.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
login ↓ [ 100% ] 10 VUs  30s

running (0m32.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
login ↓ [ 100% ] 10 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=4.57s


  █ TOTAL RESULTS 

    checks_total.......: 160    4.924994/s
    checks_succeeded...: 50.00% 80 out of 160
    checks_failed......: 50.00% 80 out of 160

    ✓ responde (no cae la ruta)
    ✗ no es 5xx
      ↳  0% — ✓ 0 / ✗ 80

    HTTP
    http_req_duration....: avg=4.05s min=3.96s med=3.98s max=4.58s p(90)=4.57s p(95)=4.57s
    http_req_failed......: 100.00% 80 out of 80
    http_reqs............: 80      2.462497/s

    EXECUTION
    iteration_duration...: avg=4.06s min=3.96s med=3.98s max=4.58s p(90)=4.57s p(95)=4.57s
    iterations...........: 80      2.462497/s
    vus..................: 10      min=10       max=10
    vus_max..............: 10      min=10       max=10

    NETWORK
    data_received........: 44 kB   1.3 kB/s
    data_sent............: 20 kB   621 B/s



running (0m32.5s), 00/10 VUs, 80 complete and 0 interrupted iterations
login ✓ [ 100% ] 10 VUs  30s
time="2026-09-22T04:48:08Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"