docs/auditoria-produccion/evidencia/H4-k6-replay-idempotente.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/replay-idempotente.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * replay: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [   3% ] 5 VUs  01.0s/30s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [   7% ] 5 VUs  02.0s/30s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [  20% ] 5 VUs  06.0s/30s

running (0m07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
replay   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  30% ] 5 VUs  09.0s/30s

running (0m10.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  33% ] 5 VUs  10.0s/30s

running (0m11.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  37% ] 5 VUs  11.0s/30s

running (0m12.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
replay   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  63% ] 5 VUs  19.0s/30s

running (0m20.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
replay   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  87% ] 5 VUs  26.0s/30s

running (0m27.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
replay   [ 100% ] 5 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration{intento:repetido}
    ✗ 'p(95)<600' p(95)=2.58s


  █ TOTAL RESULTS 

    checks_total.......: 100     3.264516/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ primer intento responde
    ✓ repeticion responde
    ✓ mismo status que el original

    HTTP
    http_req_duration........: avg=2.55s min=2.52s med=2.55s max=2.58s p(90)=2.57s p(95)=2.58s
      { intento:repetido }...: avg=2.55s min=2.52s med=2.55s max=2.58s p(90)=2.58s p(95)=2.58s
    http_req_failed..........: 100.00% 60 out of 60
    http_reqs................: 60      1.95871/s

    EXECUTION
    iteration_duration.......: avg=7.65s min=7.62s med=7.64s max=7.71s p(90)=7.71s p(95)=7.71s
    iterations...............: 20      0.652903/s
    vus......................: 5       min=5        max=5
    vus_max..................: 5       min=5        max=5

    NETWORK
    data_received............: 34 kB   1.1 kB/s
    data_sent................: 24 kB   768 B/s



running (0m30.6s), 0/5 VUs, 20 complete and 0 interrupted iterations
replay ✓ [ 100% ] 5 VUs  30s
time="2026-09-22T04:50:22Z" level=error msg="thresholds on metrics 'http_req_duration{intento:repetido}' have been crossed"