docs/auditoria-produccion/evidencia/H4-k6-saldo.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/saldo.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * saldo: 20 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
saldo   [   3% ] 20 VUs  01.0s/30s

running (0m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
saldo   [   7% ] 20 VUs  02.0s/30s

running (0m03.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
saldo   [  10% ] 20 VUs  03.0s/30s

running (0m04.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
saldo   [  13% ] 20 VUs  04.0s/30s

running (0m05.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
saldo   [  17% ] 20 VUs  05.0s/30s

running (0m06.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
saldo   [  20% ] 20 VUs  06.0s/30s

running (0m07.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
saldo   [  23% ] 20 VUs  07.0s/30s

running (0m08.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
saldo   [  27% ] 20 VUs  08.0s/30s

running (0m09.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
saldo   [  30% ] 20 VUs  09.0s/30s

running (0m10.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
saldo   [  33% ] 20 VUs  10.0s/30s

running (0m11.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
saldo   [  37% ] 20 VUs  11.0s/30s

running (0m12.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
saldo   [  40% ] 20 VUs  12.0s/30s

running (0m13.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
saldo   [  43% ] 20 VUs  13.0s/30s

running (0m14.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
saldo   [  47% ] 20 VUs  14.0s/30s

running (0m15.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
saldo   [  50% ] 20 VUs  15.0s/30s

running (0m16.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
saldo   [  53% ] 20 VUs  16.0s/30s

running (0m17.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
saldo   [  57% ] 20 VUs  17.0s/30s

running (0m18.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
saldo   [  60% ] 20 VUs  18.0s/30s

running (0m19.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
saldo   [  63% ] 20 VUs  19.0s/30s

running (0m20.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
saldo   [  67% ] 20 VUs  20.0s/30s

running (0m21.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
saldo   [  70% ] 20 VUs  21.0s/30s

running (0m22.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
saldo   [  73% ] 20 VUs  22.0s/30s

running (0m23.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
saldo   [  77% ] 20 VUs  23.0s/30s

running (0m24.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
saldo   [  80% ] 20 VUs  24.0s/30s

running (0m25.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
saldo   [  83% ] 20 VUs  25.0s/30s

running (0m26.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
saldo   [  87% ] 20 VUs  26.0s/30s

running (0m27.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
saldo   [  90% ] 20 VUs  27.0s/30s

running (0m28.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
saldo   [  93% ] 20 VUs  28.0s/30s

running (0m29.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
saldo   [  97% ] 20 VUs  29.0s/30s

running (0m30.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
saldo   [ 100% ] 20 VUs  30.0s/30s

running (0m31.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
saldo ↓ [ 100% ] 20 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<300' p(95)=2.62s
    ✗ 'p(99)<800' p(99)=2.63s


  █ TOTAL RESULTS 

    checks_total.......: 480    15.477603/s
    checks_succeeded...: 50.00% 240 out of 480
    checks_failed......: 50.00% 240 out of 480

    ✓ responde (no cae la ruta)
    ✗ no es 5xx
      ↳  0% — ✓ 0 / ✗ 240

    HTTP
    http_req_duration....: avg=2.58s min=2.55s med=2.57s max=2.63s p(90)=2.61s p(95)=2.62s
    http_req_failed......: 100.00% 240 out of 240
    http_reqs............: 240     7.738802/s

    EXECUTION
    iteration_duration...: avg=2.58s min=2.55s med=2.57s max=2.63s p(90)=2.61s p(95)=2.62s
    iterations...........: 240     7.738802/s
    vus..................: 20      min=20         max=20
    vus_max..............: 20      min=20         max=20

    NETWORK
    data_received........: 112 kB  3.6 kB/s
    data_sent............: 29 kB   929 B/s



running (0m31.0s), 00/20 VUs, 240 complete and 0 interrupted iterations
saldo ✓ [ 100% ] 20 VUs  30s
time="2026-09-22T04:48:40Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"